app/controllers/books_controller.rb

	def create
		book = Book.new(book_params)
		if book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "a"], ["body", "aaaa"], ["created_at", "2018-12-08 12:44:04.356934"], ["updated_at", "2018-12-08 12:44:04.356934"]]

	def update
		book = Book.find(params[:id])
		if book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "bb"], ["body", "bb"], ["updated_at", "2018-12-08 10:10:33.319617"], ["id", 14]]

	def destroy
		book = Book.find(params[:id])
		if book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 55], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 55]]